Revit 2027 API
FootPrintRoof.DefinesSlope Property
Retrieve or set the DefinesSlope of the curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool this[
	ModelCurve pCurve
] { get; set; }
Public Property DefinesSlope (
	pCurve As ModelCurve
) As Boolean
	Get
	Set
public:
property bool DefinesSlope[ModelCurve^ pCurve] {
	bool get (ModelCurve^ pCurve);
	void set (ModelCurve^ pCurve, bool value);
}
member DefinesSlope : bool with get, set
Parameters
pCurve ModelCurve
Property Value
Boolean
See Also
Reference
FootPrintRoof Class
Autodesk.Revit.DB Namespace